artillery.yml
config:
  target: 'http://localhost:3000'
  http:
    timout: 10
  phases:
    # Warm Up
    - duration: 10
      arrivalRate: 1
    # # Ramp Up
    - duration: 30
      arrivalRate: 10
    # # Cruising
    - duration: 200
      arrivalRate: 900
    # Crash
    # - duration: 60
    #   arrivalRate: 1000

  processor: "./DataTools/Generators/StressTestVariable.js"
scenarios:
  - name: "Get Questions"
    flow:
      - function: "variableGenerator"
      - get:
          url: "/qa/{{ qid }}/"
      
  - name: "Get Answers"
    flow: 
      - function: "variableGenerator"
      - get:
          url: "/qa/{{ aid }}/answers/"
  - name: "Post Question"
    flow:
      - function: "variableGenerator"
      - post:
          url: "/qa/{{ qid }}/"
          headers: "'Content-Type': 'application/json'"
          json:
            body: "{{ body }}"
            asker_name: "{{ name }}"
            asker_email: "{{ email }}"
  - name: "Post Answer"
    flow:
      - function: "variableGenerator"
      - post:
          url: "/qa/{{ aid }}/answers/"
          json:
            body: "{{ body }}"
            answerer_name: "{{ name }}"
            asker_email: "{{ email }}"
  - name: "Helpful Answer"
    flow:
      - function: "variableGenerator"
      - put:
          url: "/qa/answer/{{ aid }}/helpful/"
  - name: "Helpful Question"
    flow:
      - function: "variableGenerator"
      - put:
          url: "/qa/question/{{ qid }}/helpful"
  - name: "Report Question"
    flow:
      - function: "variableGenerator"
      - put:
          url: "/qa/question/{{ qid }}/report"
  - name: "Report Answer"
    flow:
      - function: "variableGenerator"
      - put:
          url: "/qa/answer/{{ aid }}/report"